[
  {
    "question": "What type of dbt model is this?",
    "route": "dbt_metadata"
  },
  {
    "question": "What schema does this dbt model belong to?",
    "route": "dbt_metadata"
  },
  {
    "question": "How many bytes does this dbt model contain?",
    "route": "dbt_metadata"
  },
  {
    "question": "How many rows does this dbt model have?",
    "route": "dbt_metadata"
  },
  {
    "question": "When was this dbt model created?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the unique id of this dbt model",
    "route": "dbt_metadata"
  },
  {
    "question": "Can you determine the type of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What's the classification for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What category does this dbt model fall under?",
    "route": "dbt_metadata"
  },
  {
    "question": "Could you specify the type of dbt model this is?",
    "route": "dbt_metadata"
  },
  {
    "question": "Do you know what kind of dbt model this is?",
    "route": "dbt_metadata"
  },
  {
    "question": "What model type is represented by this dbt instance?",
    "route": "dbt_metadata"
  },
  {
    "question": "Under what type classification does this dbt model come?",
    "route": "dbt_metadata"
  },
  {
    "question": "Which dbt model type does this example belong to?",
    "route": "dbt_metadata"
  },
  {
    "question": "I'm trying to figure out the dbt model type here, can you help?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the type designation for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Can you identify the schema for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What's the schema associated with this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "In which schema is this dbt model located?",
    "route": "dbt_metadata"
  },
  {
    "question": "Could you tell me the schema name for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Do you know the schema of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What schema is this dbt model a part of?",
    "route": "dbt_metadata"
  },
  {
    "question": "Under which schema does this dbt model fall?",
    "route": "dbt_metadata"
  },
  {
    "question": "Which schema contains this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "I need the schema name for this dbt model, can you provide it?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the name of the schema holding this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Can you tell me the byte size of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What's the total byte count for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "How many bytes make up this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Could you calculate the size in bytes of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Do you have the byte size information for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the byte size of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "How large in bytes is this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "I need the byte count for this dbt model, can you provide it?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the exact size in bytes of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Could you inform me about the size of this dbt model in bytes?",
    "route": "dbt_metadata"
  },
  {
    "question": "Can you provide the row count for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What's the total number of rows in this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "How many rows are there in this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Could you tell me the number of rows this dbt model consists of?",
    "route": "dbt_metadata"
  },
  {
    "question": "Do you know how many rows this dbt model contains?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the row count of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "How extensive, in terms of rows, is this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "I need to know the number of rows in this dbt model, can you help?",
    "route": "dbt_metadata"
  },
  {
    "question": "What number of rows does this dbt model comprise?",
    "route": "dbt_metadata"
  },
  {
    "question": "Could you specify the row quantity within this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Can you tell me the creation date of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What's the creation timestamp for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "When exactly was this dbt model initiated?",
    "route": "dbt_metadata"
  },
  {
    "question": "Could you provide the date of inception for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Do you have the creation date of this dbt model available?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the initial creation date of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "How old is this dbt model in terms of its creation date?",
    "route": "dbt_metadata"
  },
  {
    "question": "I'm curious about the start date of this dbt model, can you share it?",
    "route": "dbt_metadata"
  },
  {
    "question": "What date marks the creation of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "When did the development of this dbt model begin?",
    "route": "dbt_metadata"
  },
  {
    "question": "Can you provide the unique identifier for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What's the unique ID assigned to this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Could you tell me the unique id of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Do you know the specific unique id for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the distinct identifier of this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "How is this dbt model uniquely identified?",
    "route": "dbt_metadata"
  },
  {
    "question": "I need the unique ID for this dbt model, can you help?",
    "route": "dbt_metadata"
  },
  {
    "question": "What unique identification number is given to this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "Which unique ID is associated with this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "What is the singular identification code for this dbt model?",
    "route": "dbt_metadata"
  },
  {
    "question": "How were tables joined to generate this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "What post_hooks does this dbt model have?",
    "route": "dbt_code"
  },
  {
    "question": "Can you explain the table join logic used in this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "What method was employed to join tables in this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "Could you detail the joining of tables process for this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "How exactly were the tables combined to construct this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "Do you know the specific join types used for this DBT model's tables?",
    "route": "dbt_code"
  },
  {
    "question": "What is the process for joining tables in this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "I need information on how tables were joined in this DBT model, can you provide that?",
    "route": "dbt_code"
  },
  {
    "question": "Which joining techniques were applied to the tables in this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "How did the table joins work to create this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "What strategies were used to join tables within this DBT model?",
    "route": "dbt_code"
  },
  {
    "question": "Can you list the post_hooks configured for this dbt model?",
    "route": "dbt_code"
  },
  {
    "question": "What are the post_hook commands in this dbt model?",
    "route": "dbt_code"
  },
  {
    "question": "Could you detail the post_hooks used in this dbt model?",
    "route": "dbt_code"
  },
  {
    "question": "Do you know which post_hooks are implemented in this dbt model?",
    "route": "dbt_code"
  },
  {
    "question": "What post_hooks settings are specified for this dbt model?",
    "route": "dbt_code"
  },
  {
    "question": "How is this dbt model utilizing post_hooks?",
    "route": "dbt_code"
  },
  {
    "question": "I need to understand the post_hooks for this dbt model, can you help?",
    "route": "dbt_code"
  },
  {
    "question": "Which post_hooks are defined in this dbt model's configuration?",
    "route": "dbt_code"
  },
  {
    "question": "What are the configured post_hooks for this dbt model?",
    "route": "dbt_code"
  },
  {
    "question": "Could you show me the post_hooks this dbt model uses?",
    "route": "dbt_code"
  },
  {
    "question": "How many columns does this dbt model have?",
    "route": "dbt_columns"
  },
  {
    "question": "What is the description for this column on this dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "Can you tell me the total number of columns in this dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "What's the column count for this dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "How many columns are there in this dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "Could you provide the count of columns this dbt model contains?",
    "route": "dbt_columns"
  },
  {
    "question": "Do you know the exact number of columns in this dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "What is the total column number in this dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "How extensive, in terms of columns, is this dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "I need to know the number of columns this dbt model has, can you assist?",
    "route": "dbt_columns"
  },
  {
    "question": "What count of columns is this dbt model comprised of?",
    "route": "dbt_columns"
  },
  {
    "question": "Could you specify the number of columns included in this dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "Can you provide the description for this column in the dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "What's the detailed description for this specific column on the dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "How is this column described in the dbt model documentation?",
    "route": "dbt_columns"
  },
  {
    "question": "Could you tell me what description is given for this column in the dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "Do you know the description assigned to this column within the dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "What does the description say about this particular column on the dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "I need the description for this column from the dbt model, can you help?",
    "route": "dbt_columns"
  },
  {
    "question": "What is the description provided for this column in the context of the dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "Could you specify the description for this column as per the dbt model?",
    "route": "dbt_columns"
  },
  {
    "question": "What narrative is given for this column in the dbt model's schema?",
    "route": "dbt_columns"
  },
  {
    "question": "What is the spark configuration for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What is the location of this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Can you detail the spark configuration used for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What spark settings are applied to this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "How is the spark environment configured for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Could you provide the spark configuration details for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Do you know the configuration of spark for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What are the specifics of the spark setup for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "I need the spark configuration information for this dbt model, can you provide it?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What spark parameters are set for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Could you specify the spark environment settings for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What is the defined spark configuration for this particular dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Can you specify the storage location for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What's the directory path of this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Where is this dbt model stored?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Could you tell me the file location of this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Do you know the physical or virtual location of this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What is the exact location where this dbt model is located?",
    "route": "dbt_descriptions"
  },
  {
    "question": "How can I find the location of this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "I need the location details for this dbt model, can you help?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What location does this dbt model reside in?",
    "route": "dbt_descriptions"
  },
  {
    "question": "Could you provide the location information for this dbt model?",
    "route": "dbt_descriptions"
  },
  {
    "question": "What upstream models does this dbt model have?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Does this dbt model have any upstream models?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Is this dbt model upstream to that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Can you list the upstream models for this dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "What are the precursor models linked to this dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Which models feed into this dbt model as upstream sources?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Could you identify the upstream dependencies for this dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Do you know the models that serve as inputs to this dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "What models are considered upstream for this dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "I need to know the upstream models that contribute to this dbt model, can you provide that?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Which dbt models are upstream to this one?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "What source models does this dbt model depend on?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Could you specify the upstream dbt models for this particular model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Is there any upstream model linked to this dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Are there upstream models for this dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Does this dbt model depend on any other models as upstream sources?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Can you confirm if this dbt model has upstream dependencies?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Are there any models that feed into this dbt model as upstream?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Does this dbt model have predecessors or upstream models?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "I'm wondering if this dbt model is connected to any upstream models, can you tell me?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Could you check if there are any upstream models associated with this dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "What upstream models, if any, does this dbt model have?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Is this dbt model independent, or does it have upstream model connections?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Does this dbt model serve as an upstream source for that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Is this dbt model a precursor to that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Can you confirm if this dbt model is upstream to that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Are there connections where this dbt model is upstream to that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Does this dbt model feed into that dbt model as an upstream source?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Is this dbt model positioned upstream to that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "I'm wondering if this dbt model acts as an upstream model to that dbt model, can you verify?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Could you determine if this dbt model is considered upstream to that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "What is the upstream relationship between this dbt model and that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "Is there an upstream dependency from this dbt model to that dbt model?",
    "route": "dbt_upstream_models"
  },
  {
    "question": "What downstream models does this dbt model have?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Does this dbt model have any downstream models?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Is this dbt model downstream from that dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Can you list the models that are downstream of this dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "What models are directly dependent on this dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Which dbt models are considered downstream from this one?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Could you identify the downstream dependencies for this dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Do you know the models that this dbt model feeds into as a downstream source?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "What are the subsequent models that rely on this dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "I need to know the downstream models connected to this dbt model, can you provide that?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Which models receive data from this dbt model as part of the downstream flow?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "What dbt models are impacted by changes to this model, downstream-wise?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Could you specify which models are in the downstream lineage of this dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Are there any models downstream from this dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Does this dbt model serve as an upstream source for other models?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Can you confirm if there are downstream dependencies for this dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Are there any dbt models that rely on this one as a source?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Is this dbt model an upstream source for any subsequent models?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Do any models depend on this dbt model downstream?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "I'm curious, does this dbt model have models depending on it in the workflow?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Could you check if this dbt model has any downstream models linked to it?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "What downstream models, if any, are associated with this dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Is this dbt model linked to any models downstream in the data pipeline?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Does this dbt model act as a downstream dependency for that dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Is this dbt model positioned downstream relative to that dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Can you confirm if this dbt model is a downstream model from that one?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Are we considering this dbt model to be downstream from that particular dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Does this dbt model function as a successor to that dbt model in the pipeline?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Is this dbt model in the role of a downstream model to that one?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Could you verify if this dbt model is situated downstream of that dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "Is this dbt model a direct downstream entity from that dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "I'm trying to understand, is this dbt model downstream from that dbt model?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "In the data flow, does this dbt model come after that dbt model, making it downstream?",
    "route": "dbt_downstream_models"
  },
  {
    "question": "What is the capital of France?",
    "route": null
  },
  {
    "question": "how many people live in the US?",
    "route": null
  },
  {
    "question": "when is the best time to visit Bali?",
    "route": null
  },
  {
    "question": "how do I learn a language?",
    "route": null
  },
  {
    "question": "tell me an interesting fact",
    "route": null
  },
  {
    "question": "what is the best programming language?",
    "route": null
  },
  {
    "question": "I'm interested in learning about llama 2",
    "route": null
  }
]
